BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/AT90CAN32.PIC
        <edc:SFRDef edc:_addr="0xC9" edc:access="nnnnnnnn" edc:cname="UCSR1B" edc:nzwidth="0x8" ltx:memberofperipheral="USART1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB81" edc:desc="Transmit Data Bit 8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB81" edc:desc="Receive Data Bit 8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UCSZ12" edc:desc="Character Size" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXEN1" edc:desc="Transmitter Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXEN1" edc:desc="Receiver Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UDRIE1" edc:desc="USART Data register Empty Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXCIE1" edc:desc="TX Complete Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXCIE1" edc:desc="RX Complete Interrupt Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xCA" edc:access="-nnnnnnn" edc:cname="UCSR1C" edc:nzwidth="0x8" ltx:memberofperipheral="USART1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="UCPOL1" edc:desc="Clock Polarity" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UCSZ1" edc:desc="Character Size" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="USBS1" edc:desc="Stop Bit Select" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="1-bit" edc:when="(field &amp; 0x1) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="2-bit" edc:when="(field &amp; 0x1) == 0x01"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="UPM1" edc:desc="Parity Mode Bits" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="Disabled" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="Enabled, Even Parity" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="Enabled, Odd Parity" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="UMSEL1" edc:desc="USART Mode Select" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="Asynchronous Operation" edc:when="(field &amp; 0x1) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="Synchronous Operation" edc:when="(field &amp; 0x1) == 0x01"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xCB" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0xCC" edc:access="nnnnnnnnnnnnnnnn" edc:cname="UBRR1" edc:nzwidth="0x10" ltx:memberofperipheral="USART1"/>
        <edc:SFRDef edc:_addr="0xCE" edc:access="nnnnnnnn" edc:cname="UDR1" edc:nzwidth="0x8" ltx:memberofperipheral="USART1"/>
        <edc:AdjustPoint edc:_addr="0xCF" edc:offset="0x9"/>
        <edc:SFRDef edc:_addr="0xD8" edc:access="nnnnnnnn" edc:cname="CANGCON" edc:nzwidth="0x8" ltx:memberofperipheral="CAN">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SWRES" edc:desc="Software Reset Request" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ENASTB" edc:desc="Enable / Standby" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TEST" edc:desc="Test Mode" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LISTEN" edc:desc="Listening Mode" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SYNTTC" edc:desc="Synchronization of TTC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TTC" edc:desc="Time Trigger Communication" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OVRQ" edc:desc="Overload Frame Request" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ABRQ" edc:desc="Abort Request" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xD9" edc:access="-n-nnnnn" edc:cname="CANGSTA" edc:nzwidth="0x8" ltx:memberofperipheral="CAN">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ERRP" edc:desc="Error Passive Mode" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BOFF" edc:desc="Bus Off Mode" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ENFG" edc:desc="Enable Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXBSY" edc:desc="Receiver Busy" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXBSY" edc:desc="Transmitter Busy" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="OVRG" edc:desc="Overload Frame Flag" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xDA" edc:access="nnnnnnnn" edc:cname="CANGIT" edc:nzwidth="0x8" ltx:memberofperipheral="CAN">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AERG" edc:desc="Ackknowledgement Error General" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FERG" edc:desc="Form Error General" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CERG" edc:desc="CRC Error General" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SERG" edc:desc="Stuff Error General" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BXOK" edc:desc="Burst Receive Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OVRTIM" edc:desc="Overrun CAN Timer" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BOFFIT" edc:desc="Bus Off Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CANIT" edc:desc="General Interrupt Flag" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xDB" edc:access="nnnnnnnn" edc:cname="CANGIE" edc:nzwidth="0x8" ltx:memberofperipheral="CAN">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ENOVRT" edc:desc="Enable CAN Timer Overrun Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ENERG" edc:desc="Enable General Error Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ENBX" edc:desc="Enable Burst Receive Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ENERR" edc:desc="Enable MOb Error Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ENTX" edc:desc="Enable Transmitt Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ENRX" edc:desc="Enable Receive Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ENBOFF" edc:desc="Enable Bus Off INterrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ENIT" edc:desc="Enable all Interrupts" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xDC" edc:access="nnnnnnnn" edc:cname="CANEN2" edc:nzwidth="0x8" ltx:memberofperipheral="CAN">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ENMOB" edc:desc="Enable MOb" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xDD" edc:access="-nnnnnnn" edc:cname="CANEN1" edc:nzwidth="0x8" ltx:memberofperipheral="CAN">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ENMOB" edc:desc="Enable MOb" edc:nzwidth="0x7"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
